NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/core/src/transport.c
/* Copyright (c) 2010 - 2017, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#include <stdint.h>
#include <stdbool.h>
#include <stddef.h>
#include <string.h>
#include <stdlib.h>

#include <nrf_error.h>

#include "utils.h"
#include "log.h"
#include "enc.h"
#include "event.h"
#include "nrf_mesh.h"
#include "network.h"
#include "net_state.h"
#include "replay_cache.h"
#include "internal_event.h"
#include "timer_scheduler.h"
#include "bearer_event.h"
#include "toolchain.h"
#include "transport.h"
#include "nrf_mesh_assert.h"
#include "nrf_mesh_utils.h"
#include "nrf_mesh_externs.h"
#include "packet_mesh.h"

/*********************
 * Local definitions *
 *********************/

/** Mask for SeqZero value. */
#define TRANSPORT_SAR_SEQZERO_MASK (TRANSPORT_SAR_SEQNUM_DIFF_MAX)
#define TRANSPORT_SAR_SEGMENT_COUNT_MAX 32
#define TRANSPORT_SAR_PDU_LEN(control) ((control) ? PACKET_MESH_TRS_SEG_CONTROL_PDU_MAX_SIZE : PACKET_MESH_TRS_SEG_ACCESS_PDU_MAX_SIZE)
#define TRANSPORT_SAR_PACKET_MAX_SIZE(control) (TRANSPORT_SAR_SEGMENT_COUNT_MAX * TRANSPORT_SAR_PDU_LEN(control))
#define TRANSPORT_UNSEG_PDU_LEN(control) ((control) ? PACKET_MESH_TRS_UNSEG_CONTROL_PDU_MAX_SIZE : PACKET_MESH_TRS_UNSEG_ACCESS_PDU_MAX_SIZE)

#define TRANSPORT_MIC_SIZE_SMALL   4
#define TRANSPORT_MIC_SIZE_LARGE   8
#define TRANSPORT_MIC_SIZE_CONTROL 0

#define SAR_TOKEN ((nrf_mesh_tx_token_t) 0x5E65E65E)

NRF_MESH_STATIC_ASSERT(IS_POWER_OF_2(TRANSPORT_SAR_RX_CACHE_LEN));
/* The SEQZERO mask must be (power of two - 1) to work as a mask (ie if a bit in the mask is set to
 * 1, all lower bits must also be 1). */
NRF_MESH_STATIC_ASSERT(IS_POWER_OF_2(TRANSPORT_SAR_SEQZERO_MASK + 1));

#define TRANSPORT_SAR_RX_CACHE_LEN_MASK    (TRANSPORT_SAR_RX_CACHE_LEN - 1)
/*********************
 * Local types *
 *********************/

/**
 * Transport configuration struct.
 *
 * @note All timing values are given in microseconds.
 */
typedef struct
{
    timestamp_t rx_timeout;                /**< Timeout for receiving a SAR message. */
    timestamp_t rx_ack_base_timeout;       /**< RX acknowledgement timer timeout value. */
    timestamp_t rx_ack_per_hop_addition;   /**< RX acknowledgement time delay added per hop in the transmission. */
    timestamp_t tx_retry_base_timeout;     /**< Base timeout for TX retries.*/
    timestamp_t tx_retry_per_hop_addition; /**< TX retry time added per hop in the transmission. */
    uint8_t tx_retries;                    /**< Number of retries before cancelling SAR session. */
    uint8_t segack_ttl; /**< Default TTL value for segment acknowledgement messages. */
    uint8_t szmic;      /**< Use 32- or 64-bit MIC for application payload. */
} transport_config_t;

typedef struct
{
    uint16_t seq_zero;
    uint8_t segment_offset;
    uint8_t last_segment;
    uint8_t mic_size;
} transport_segmentation_metadata_t;

typedef struct
{
    bool segmented;
    uint8_t mic_size;
    union
    {
        struct
        {
            bool using_app_key;
            uint8_t app_key_id;
        } access;
        struct
        {
            transport_control_opcode_t opcode;
        } control;
    } type;
    transport_segmentation_metadata_t segmentation;
    network_packet_metadata_t net;
    const nrf_mesh_application_secmat_t * p_security_material;
    nrf_mesh_tx_token_t token;
} transport_packet_metadata_t;

/**
 * Transport SAR session types.
 */
typedef enum
{
    TRS_SAR_SESSION_INACTIVE,   /**< The session isn't active. */
    TRS_SAR_SESSION_TX,         /**< TX session. */
    TRS_SAR_SESSION_RX          /**< RX session. */
} trs_sar_session_t;

/** State of the SAR RX session ack. */
typedef enum
{
    SAR_ACK_STATE_IDLE,   /**< No acking in progress. */
    SAR_ACK_STATE_TIMER_ACTIVE, /**< Timer is waiting to fire */
    SAR_ACK_STATE_PENDING /**< An ack packet should be sent at the first opportunity. */
} sar_ack_state_t;
/**
 * Transport SAR PDU structure.
 *
 * @note All multi-octet values are assumed *little* endian.
 */
typedef struct
{
    transport_packet_metadata_t metadata;
    /** Timer used to resend or abort the SAR session. */
    timer_event_t timer_event;
    /** Transport SAR session header. */
    struct
    {
        trs_sar_session_t session_type; /**< SAR session type. */
        uint16_t length;                /**< Total length of the session data (payload + mic). */
        uint32_t block_ack;             /**< Bit-field of the acknowledged segments. */
        union
        {
            /** Fields that are only valid for TX-sessions. */
            struct
            {
                uint8_t  start_index;           /**< Segment index to start transmitting from. Used to recover from out-of-memory errors. */
                uint8_t  retries;               /**< Number of retries left. */
                bool payload_encrypted;         /**< Flag indicating whether the payload has been encrypted. */
                bool seqzero_is_set;         /**< Flag indicating whether the seqzero has been set. */
                nrf_mesh_tx_token_t token;      /**< TX Token set by the user. */
            } tx;
            /** Fields that are only valid for RX-sesssions */
            struct
            {
                /** Acknowledgement timer */
                timer_event_t ack_timer;
                sar_ack_state_t ack_state;
            } rx;
        } params;
    } session;
    /**
    * Re-segmented SAR payload with 4 byte MIC at the end.
    */
    uint8_t * payload;
} trs_sar_ctx_t;

