NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/core/src/transport.c
/** Completed SAR session, used to cache previous sessions. */
typedef struct
{
    bool successful;
    uint8_t ivi;
    uint16_t src;
    uint32_t seqauth_seqnum;
} completed_sar_session_t;

/** A consumer of control packets. */
typedef struct
{
    const transport_control_packet_handler_t * p_handlers; /**< List of opcodes and their handler functions. */
    uint32_t handler_count; /**< Number of handlers. */
} control_packet_consumer_t;
/********************
 * Static variables *
 ********************/

static transport_config_t m_trs_config;
static trs_sar_ctx_t m_trs_sar_sessions[TRANSPORT_SAR_SESSIONS_MAX];

static transport_sar_alloc_t    m_sar_alloc;   /**< Allocation function for SAR packets. */
static transport_sar_release_t  m_sar_release; /**< Release function for SAR packets. */

static uint32_t m_sar_session_cache_head;
static completed_sar_session_t m_sar_session_cache[TRANSPORT_SAR_RX_CACHE_LEN];

/** Flag used to trigger SAR processing. */
static bearer_event_flag_t m_sar_process_flag;

static control_packet_consumer_t m_control_packet_consumers[TRANSPORT_CONTROL_PACKET_CONSUMERS_MAX];
static uint32_t m_control_packet_consumer_count;
/********************
 * Static functions *
 ********************/

static void ack_timeout(timestamp_t timestamp, void * p_context);
static void retry_timeout(timestamp_t timestamp, void * p_context);
static void abort_timeout(timestamp_t timestamp, void * p_context);

static inline uint32_t block_ack_full(transport_packet_metadata_t * p_metadata)
{
    NRF_MESH_ASSERT(p_metadata->segmented);
    return ((1u << (p_metadata->segmentation.last_segment + 1)) - 1);
}
static void upper_transport_packet_in(const uint8_t * p_upper_trs_packet,
                                      uint32_t upper_trs_packet_len,
                                      transport_packet_metadata_t * p_metadata,
                                      const nrf_mesh_rx_metadata_t * p_rx_metadata);

static uint32_t seqauth_sequence_number_get(uint32_t seqnum, uint16_t seqzero)
{
    if ((seqnum & TRANSPORT_SAR_SEQZERO_MASK) < seqzero)
    {
        return ((seqnum - ((seqnum & TRANSPORT_SAR_SEQZERO_MASK) - seqzero) - (TRANSPORT_SAR_SEQZERO_MASK + 1)));
    }
    else
    {
        return ((seqnum - ((seqnum & TRANSPORT_SAR_SEQZERO_MASK) - seqzero)));
    }
}

static void m_send_replay_cache_full_event(uint16_t src, uint8_t ivi, nrf_mesh_rx_failed_reason_t reason)
{
    nrf_mesh_evt_t evt =
        {
            .type = NRF_MESH_EVT_RX_FAILED,
            .params.rx_failed.src = src,
            .params.rx_failed.ivi = ivi,
            .params.rx_failed.reason = reason
        };
    event_handle(&evt);
}

static void m_send_sar_cancel_event(nrf_mesh_tx_token_t token, nrf_mesh_sar_session_cancel_reason_t reason)
{
    nrf_mesh_evt_t evt =
        {
            .type = NRF_MESH_EVT_SAR_FAILED,
            .params.sar_failed.token = token,
            .params.sar_failed.reason = reason
        };
    event_handle(&evt);
}

static inline uint32_t rx_ack_timer_delay_get(uint8_t ttl)
{
    return m_trs_config.rx_ack_base_timeout + m_trs_config.rx_ack_per_hop_addition * ttl;
}

static inline uint32_t tx_retry_timer_delay_get(uint8_t ttl)
{
    return m_trs_config.tx_retry_base_timeout + m_trs_config.tx_retry_per_hop_addition * ttl;
}

/**
 * Check whether the RX SAR session has been handled before. As the sessions are stored in a FIFO
 * cache manner, getting a false on this function does not guarantee that the session hasn't been
 * handled before, but if it returns @c true, it has definitely been handled.
 *
 * @param[in] p_metadata Metadata to check for.
 * @param[in,out] p_successful Returns whether the sar session finished successfully. Only valid if
 * the function returns @c true.
 *
 * @retval true This session has been handled before, and the @p p_successful parameter has been
 * populated.
 * @retval false No information on whether the session has been handled before was found.
 */
static inline bool sar_rx_session_previously_handled(const transport_packet_metadata_t * p_metadata, bool * p_successful)
{
    NRF_MESH_ASSERT(p_metadata->segmented);

    const completed_sar_session_t completed_session = {
        .src = p_metadata->net.src,
        .seqauth_seqnum = seqauth_sequence_number_get(p_metadata->net.internal.sequence_number,
                                                      p_metadata->segmentation.seq_zero),
        .ivi = p_metadata->net.internal.iv_index & NETWORK_IVI_MASK
    };

    for (uint32_t i = 0; i < TRANSPORT_SAR_RX_CACHE_LEN && i < m_sar_session_cache_head; ++i)
    {
        if (completed_session.seqauth_seqnum == m_sar_session_cache[i].seqauth_seqnum &&
            completed_session.src == m_sar_session_cache[i].src &&
            completed_session.ivi == m_sar_session_cache[i].ivi)
        {
            *p_successful = m_sar_session_cache[i].successful;
            return true;
        }
    }
    return false;
}


/**
 * Mark the session holding the given metadata as handled, with the given outcome.
 *
 * @param[in] p_metadata SAR metadata handled.
 * @param[in] success Whether or not the session ended successfully.
 */
static inline void sar_rx_session_mark_as_handled(const transport_packet_metadata_t * p_metadata, bool success)
{
    NRF_MESH_ASSERT(p_metadata->segmented);

    const completed_sar_session_t completed_session = {
        .src = p_metadata->net.src,
        .seqauth_seqnum = seqauth_sequence_number_get(p_metadata->net.internal.sequence_number,
                                                      p_metadata->segmentation.seq_zero),
        .ivi = p_metadata->net.internal.iv_index & NETWORK_IVI_MASK,
        .successful = success
    };
    m_sar_session_cache[(m_sar_session_cache_head++) & TRANSPORT_SAR_RX_CACHE_LEN_MASK] = completed_session;
}

/**
 * Allocate the given SAR context with the given parameters.
 *
 * @param[in,out] p_sar_ctx SAR context
 * @param[in] p_metadata Metadata to use in the context.
 * @param[in] session_type Type of session.
 * @param[in] length Length of SAR data, including MIC.
 *
 * @returns Whether the allocation was successful.
 */
static bool sar_ctx_alloc(trs_sar_ctx_t * p_sar_ctx,
                          const transport_packet_metadata_t * p_metadata,
                          trs_sar_session_t session_type,
                          uint32_t length)
{
    NRF_MESH_ASSERT(session_type == TRS_SAR_SESSION_RX ||
                    session_type == TRS_SAR_SESSION_TX);
    NRF_MESH_ASSERT(p_sar_ctx->payload == NULL);
    p_sar_ctx->payload = m_sar_alloc(length);
    if (p_sar_ctx->payload == NULL)
    {
        return false;
    }
    memcpy(&p_sar_ctx->metadata, p_metadata, sizeof(transport_packet_metadata_t));
    p_sar_ctx->session.block_ack = 0;
    p_sar_ctx->session.length = length;
    /* Set the network metadata sequence number and IV index to the values in the first segment in
     * the session. */
    p_sar_ctx->metadata.net.internal.sequence_number =
        seqauth_sequence_number_get(p_metadata->net.internal.sequence_number,
                                    p_metadata->segmentation.seq_zero);

    if (session_type == TRS_SAR_SESSION_TX)
    {
        p_sar_ctx->session.params.tx.retries = m_trs_config.tx_retries;
        p_sar_ctx->session.params.tx.payload_encrypted = false;
        p_sar_ctx->session.params.tx.seqzero_is_set = false;
        p_sar_ctx->session.params.tx.start_index = 0;
        /* Set the TX token to indicate a SAR packet, use the SAR-TX token to keep the user-token.
         * This way we'll know that we got a TX complete on a SAR packet, so we can forward the TX
         * complete when the entire SAR packet is done. */
        p_sar_ctx->session.params.tx.token = p_metadata->token;
        p_sar_ctx->metadata.token = SAR_TOKEN;
        p_sar_ctx->timer_event.cb = retry_timeout;
        p_sar_ctx->timer_event.p_context = p_sar_ctx;
    }
    else
    {
        p_sar_ctx->metadata.token = SAR_TOKEN;
        p_sar_ctx->session.params.rx.ack_state = SAR_ACK_STATE_IDLE;
        p_sar_ctx->session.params.rx.ack_timer.cb = ack_timeout;
        p_sar_ctx->session.params.rx.ack_timer.p_context = p_sar_ctx;
        p_sar_ctx->timer_event.cb = abort_timeout;
        p_sar_ctx->timer_event.p_context = p_sar_ctx;
    }
    /* The IV index should stay the same for the duration of the session. */
    net_state_iv_index_lock(true);
    p_sar_ctx->session.session_type = session_type;
    return true;
}
static void sar_ctx_free(trs_sar_ctx_t * p_sar_ctx)
{
    m_sar_release(p_sar_ctx->payload);
    p_sar_ctx->payload = NULL;
    timer_sch_abort(&p_sar_ctx->timer_event);
    if (p_sar_ctx->session.session_type == TRS_SAR_SESSION_RX)
    {
        timer_sch_abort(&p_sar_ctx->session.params.rx.ack_timer);
    }
    p_sar_ctx->session.session_type = TRS_SAR_SESSION_INACTIVE;
    net_state_iv_index_lock(false);
}

