NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/core/src/transport.c
static void sar_ctx_cancel(trs_sar_ctx_t * p_sar_ctx, nrf_mesh_sar_session_cancel_reason_t reason)
{
    NRF_MESH_ASSERT(p_sar_ctx != NULL);

    __INTERNAL_EVENT_PUSH(INTERNAL_EVENT_SAR_CANCELLED, reason, 0, NULL);

    sar_rx_session_mark_as_handled(&p_sar_ctx->metadata, false);
    m_send_sar_cancel_event(p_sar_ctx->session.params.tx.token, reason);
    sar_ctx_free(p_sar_ctx);

    __LOG(LOG_SRC_TRANSPORT, LOG_LEVEL_INFO, "Dropped SAR session %u\n", p_sar_ctx->session.session_type);
}

static void sar_ctx_rx_complete(trs_sar_ctx_t * p_sar_ctx)
{
    sar_rx_session_mark_as_handled(&p_sar_ctx->metadata, true);
    sar_ctx_free(p_sar_ctx);
}

static void sar_ctx_tx_complete(trs_sar_ctx_t * p_sar_ctx)
{
    NRF_MESH_ASSERT(p_sar_ctx->session.session_type == TRS_SAR_SESSION_TX);
    nrf_mesh_evt_t evt;
    evt.type = NRF_MESH_EVT_TX_COMPLETE;
    evt.params.tx_complete.token = p_sar_ctx->session.params.tx.token;
    event_handle(&evt);
    sar_ctx_free(p_sar_ctx);
    __INTERNAL_EVENT_PUSH(INTERNAL_EVENT_SAR_SUCCESS, 0, 0, NULL);
}

static void ack_timer_reset(trs_sar_ctx_t * p_sar_ctx)
{
    NRF_MESH_ASSERT(p_sar_ctx->session.session_type == TRS_SAR_SESSION_RX);
    uint32_t delay = rx_ack_timer_delay_get(m_trs_config.segack_ttl);
    timer_sch_reschedule(&p_sar_ctx->session.params.rx.ack_timer, timer_now() + delay);
    p_sar_ctx->session.params.rx.ack_state = SAR_ACK_STATE_TIMER_ACTIVE;
}

static void rx_incomplete_timer_reset(trs_sar_ctx_t * p_sar_ctx)
{
    NRF_MESH_ASSERT(p_sar_ctx->session.session_type == TRS_SAR_SESSION_RX);
    uint32_t delay = m_trs_config.rx_timeout;
    timer_sch_reschedule(&p_sar_ctx->timer_event, timer_now() + delay);
}

static void tx_retry_timer_reset(trs_sar_ctx_t * p_sar_ctx)
{
    NRF_MESH_ASSERT(p_sar_ctx->session.session_type == TRS_SAR_SESSION_TX);

    if (p_sar_ctx->metadata.net.dst.type == NRF_MESH_ADDRESS_TYPE_UNICAST)
    {
        p_sar_ctx->timer_event.interval = tx_retry_timer_delay_get(p_sar_ctx->metadata.net.ttl);
    }
    else
    {
        /* For non-unicast addresses, we're not going to get any acknowledgements, so there's no
         * point in scaling the retry interval according to TTL. */
        p_sar_ctx->timer_event.interval = tx_retry_timer_delay_get(0);
    }
    timer_sch_reschedule(&p_sar_ctx->timer_event, timer_now() + p_sar_ctx->timer_event.interval);
}


static void trs_packet_header_build(const transport_packet_metadata_t * p_metadata, packet_mesh_trs_packet_t * p_packet)
{
    if (p_metadata->net.control_packet)
    {
        packet_mesh_trs_control_opcode_set(p_packet, p_metadata->type.control.opcode);
    }
    else
    {
        packet_mesh_trs_access_akf_set(p_packet, p_metadata->type.access.using_app_key);
        packet_mesh_trs_access_aid_set(p_packet, p_metadata->type.access.app_key_id);
    }

    packet_mesh_trs_common_seg_set(p_packet, p_metadata->segmented);

    if (p_metadata->segmented)
    {
        packet_mesh_trs_seg_szmic_set(p_packet, p_metadata->mic_size == TRANSPORT_MIC_SIZE_LARGE);
        packet_mesh_trs_seg_seqzero_set(p_packet, p_metadata->segmentation.seq_zero);
        packet_mesh_trs_seg_sego_set(p_packet, p_metadata->segmentation.segment_offset);
        packet_mesh_trs_seg_segn_set(p_packet, p_metadata->segmentation.last_segment);
    }
}

static uint32_t upper_trs_packet_alloc(transport_packet_metadata_t * p_metadata,
                                        network_tx_packet_buffer_t * p_net_buf,
                                        uint32_t transport_data_len,
                                        uint8_t ** pp_upper_trs_payload)
{
    uint32_t header_len = (p_metadata->segmented ?
                           PACKET_MESH_TRS_SEG_PDU_OFFSET :
                           PACKET_MESH_TRS_UNSEG_PDU_OFFSET);
    p_net_buf->user_data.payload_len = header_len + transport_data_len;
    p_net_buf->user_data.p_metadata = &p_metadata->net;
    p_net_buf->user_data.token = p_metadata->token;
    uint32_t status = network_packet_alloc(p_net_buf);
    if (status == NRF_SUCCESS)
    {
        *pp_upper_trs_payload = &p_net_buf->p_payload[header_len];
    }
    return status;
}

/**
 * Ack the SAR session.
 *
 * @note Enforces specification rule saying only to ack if the destination address is a unicast
 * address (Mesh Profile Specification v1.0, section 3.5.3.4).
 *
 * @param[in] p_metadata Metadata of the SAR session to ack.
 * @param[in] block_ack Ack bitfield value.
 *
 * @retval NRF_SUCCESS The ack was successful, or the session was not directed to a unicast address.
 * @retval NRF_ERROR_NO_MEM
 */
static uint32_t sar_ack_send(const transport_packet_metadata_t * p_metadata, uint32_t block_ack)
{
    /* We only ack on unicast packets */
    uint32_t status = NRF_SUCCESS;
    if (p_metadata->net.dst.type == NRF_MESH_ADDRESS_TYPE_UNICAST)
    {
        packet_mesh_trs_control_packet_t packet_buffer;
        memset(&packet_buffer, 0, sizeof(packet_buffer));
        packet_mesh_trs_control_segack_seqzero_set(&packet_buffer, p_metadata->segmentation.seq_zero);
        packet_mesh_trs_control_segack_block_ack_set(&packet_buffer, block_ack);

        transport_control_packet_t control_packet;
        control_packet.data_len           = PACKET_MESH_TRS_CONTROL_SEGACK_SIZE;
        control_packet.dst.type           = NRF_MESH_ADDRESS_TYPE_UNICAST;
        control_packet.dst.value          = p_metadata->net.src;
        control_packet.dst.p_virtual_uuid = NULL;
        control_packet.opcode             = TRANSPORT_CONTROL_OPCODE_SEGACK;
        control_packet.p_data             = &packet_buffer;
        control_packet.p_net_secmat       = p_metadata->net.p_security_material;
        control_packet.reliable           = false;
        control_packet.src                = p_metadata->net.dst.value;
        if (p_metadata->net.ttl == 0)
        {
            /* Respond with TTL=0 to TTL=0 messages. (Mesh Profile Specification v1.0, section 3.5.2.3) */
            control_packet.ttl = 0;
        }
        else
        {
            control_packet.ttl = m_trs_config.segack_ttl;
        }

        status = transport_control_tx(&control_packet, SAR_TOKEN);

        if (status == NRF_SUCCESS)
        {
            __INTERNAL_EVENT_PUSH(INTERNAL_EVENT_ACK_QUEUED, 0, PACKET_MESH_TRS_CONTROL_SEGACK_SIZE, &packet_buffer);
        }
    }
    return status;
}

static bool sar_rx_ctx_create(trs_sar_ctx_t * p_sar_ctx, transport_packet_metadata_t * p_metadata)
{
    bool success = true;
    const uint32_t total_length = (p_metadata->segmentation.last_segment + 1) * TRANSPORT_SAR_PDU_LEN(p_metadata->net.control_packet);

