NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/core/src/transport.c
    if (total_length > TRANSPORT_SAR_PACKET_MAX_SIZE(p_metadata->net.control_packet))
    {
        __LOG(LOG_SRC_TRANSPORT, LOG_LEVEL_ERROR, "Invalid length: %u\n", total_length);
        return false;
    }

    if (!replay_cache_has_room(p_metadata->net.src,
                               p_metadata->net.internal.iv_index & NETWORK_IVI_MASK))
    {
        (void) m_send_replay_cache_full_event(p_metadata->net.src,
                                              p_metadata->net.internal.iv_index & NETWORK_IVI_MASK,
                                              NRF_MESH_RX_FAILED_REASON_REPLAY_CACHE_FULL);
        success = false;
    }
    else
    {
        success = sar_ctx_alloc(p_sar_ctx, p_metadata, TRS_SAR_SESSION_RX, total_length);
    }

    if (!success)
    {
        /* Send block ack=0 to indicate failure to receive. No recovery from out of memory error
         * possible. */
        (void) sar_ack_send(&p_sar_ctx->metadata, 0);
        m_send_sar_cancel_event(0, NRF_MESH_SAR_CANCEL_REASON_NO_MEM);
    }

    return success;
}

static trs_sar_ctx_t * sar_ctx_find(uint16_t src, uint16_t seq_zero)
{
    trs_sar_ctx_t * p_sar_ctx = NULL;
    /* Check if the packet is part of an ongoing transaction. */
    for (int i = 0; i < TRANSPORT_SAR_SESSIONS_MAX; ++i)
    {
        if (m_trs_sar_sessions[i].session.session_type == TRS_SAR_SESSION_INACTIVE)
        {
            if (p_sar_ctx == NULL)
            {
                /* Use this context for now, but keep searching for an existing session allocated to
                 * this message. */
                p_sar_ctx = &m_trs_sar_sessions[i];
            }
        }
        else if (m_trs_sar_sessions[i].metadata.net.src == src &&
                 m_trs_sar_sessions[i].metadata.segmentation.seq_zero == seq_zero)
        {
            /* Found the matching session */
            p_sar_ctx = &m_trs_sar_sessions[i];
            break;
        }
    }
    return p_sar_ctx;
}

static trs_sar_ctx_t * sar_rx_ctx_find_or_create(transport_packet_metadata_t * p_metadata)
{
    trs_sar_ctx_t * p_sar_ctx = sar_ctx_find(p_metadata->net.src, p_metadata->segmentation.seq_zero);
    if (p_sar_ctx == NULL)
    {
        return NULL;
    }
    if (p_sar_ctx->session.session_type == TRS_SAR_SESSION_INACTIVE)
    {
        if (!sar_rx_ctx_create(p_sar_ctx, p_metadata))
        {
            return NULL;
        }
    }
    return p_sar_ctx;
}

static void trs_sar_seg_packet_in(const uint8_t * p_segment_payload,
                                  uint32_t segment_len,
                                  transport_packet_metadata_t * p_metadata,
                                  const nrf_mesh_rx_metadata_t * p_rx_metadata)
{
    bool was_successful = false;
    if (sar_rx_session_previously_handled(p_metadata, &was_successful))
    {
        /* Already processed this session. */
        uint32_t block_ack = (was_successful ? block_ack_full(p_metadata) : 0);
        (void) sar_ack_send(p_metadata, block_ack);
        return;
    }

    trs_sar_ctx_t * p_sar_ctx = sar_rx_ctx_find_or_create(p_metadata);
    if (p_sar_ctx == NULL)
    {
        m_send_sar_cancel_event(0, NRF_MESH_SAR_CANCEL_REASON_NO_MEM);
        return;
    }

    if (p_metadata->net.internal.sequence_number < p_sar_ctx->metadata.net.internal.sequence_number ||
        p_metadata->net.internal.iv_index != p_sar_ctx->metadata.net.internal.iv_index)
    {
        /* From Mesh Profile Specification v1.0, section 3.5.3.4: If the lower transport layer receives a segment for
         * a message with a SeqAuth value less than the sequence authentication value, then it shall
         * ignore that segment. */
        return;
    }

    __LOG(LOG_SRC_TRANSPORT, LOG_LEVEL_INFO, "Got segment %u\n", p_metadata->segmentation.segment_offset);

    /* Reset timers, even if we already received this segment. */
    rx_incomplete_timer_reset(p_sar_ctx);

    /* Only ACK if sent to unicast address. */
    if (p_sar_ctx->metadata.net.dst.type == NRF_MESH_ADDRESS_TYPE_UNICAST &&
        p_sar_ctx->session.params.rx.ack_state == SAR_ACK_STATE_IDLE) /* The ack timer should not be reset once it's running */
    {
        ack_timer_reset(p_sar_ctx);
    }

    if (p_sar_ctx->session.block_ack & (1u << p_metadata->segmentation.segment_offset))
    {
        /* Segment already received. */
        return;
    }

    p_sar_ctx->session.block_ack |= (1u << p_metadata->segmentation.segment_offset);

    if (p_metadata->segmentation.segment_offset == p_sar_ctx->metadata.segmentation.last_segment)
    {
        /* Last segment might not be the full length of a normal segment, update total length */
        p_sar_ctx->session.length =
            segment_len + (p_sar_ctx->metadata.segmentation.last_segment *
                           TRANSPORT_SAR_PDU_LEN(p_metadata->net.control_packet));
    }
    else if (segment_len != TRANSPORT_SAR_PDU_LEN(p_metadata->net.control_packet))
    {
        /* Got a non-conformant segment length, discard the packet. */
        sar_ctx_cancel(p_sar_ctx, NRF_MESH_SAR_CANCEL_REASON_INVALID_FORMAT);
        return;
    }

    memcpy(&p_sar_ctx->payload[p_metadata->segmentation.segment_offset *
                               TRANSPORT_SAR_PDU_LEN(p_metadata->net.control_packet)],
           p_segment_payload,
           segment_len);

    if (p_sar_ctx->session.block_ack == block_ack_full(&p_sar_ctx->metadata))
    {
        /* All packets have arrived */
        upper_transport_packet_in(p_sar_ctx->payload,
                                  p_sar_ctx->session.length,
                                  &p_sar_ctx->metadata,
                                  p_rx_metadata);
        /* Release and ack regardless of whether upper layer succeeds */
        p_sar_ctx->session.params.rx.ack_state = SAR_ACK_STATE_PENDING;
        if (sar_ack_send(&p_sar_ctx->metadata, p_sar_ctx->session.block_ack) == NRF_SUCCESS)
        {
            p_sar_ctx->session.params.rx.ack_state = SAR_ACK_STATE_IDLE;
            sar_ctx_rx_complete(p_sar_ctx);
        }
    }
}

static bool test_transport_decrypt(const nrf_mesh_application_secmat_t * p_app_security_material, ccm_soft_data_t * p_ccm_data)
{
    bool mic_passed = false;
    if (p_app_security_material != NULL)
    {
        p_ccm_data->p_key = p_app_security_material->key;
        enc_aes_ccm_decrypt(p_ccm_data, &mic_passed);
        if (mic_passed)
        {
            __LOG(LOG_SRC_TRANSPORT, LOG_LEVEL_INFO, "Message decrypted\n");
        }
    }
    return mic_passed;
}

static void upper_trs_packet_encrypt(const uint8_t * p_unencrypted_upper_trs_packet,
                                     uint8_t * p_encrypted_upper_trs_packet,
                                     uint32_t upper_trs_payload_len,
                                     const transport_packet_metadata_t * p_metadata)
{
    NRF_MESH_ASSERT(p_unencrypted_upper_trs_packet != NULL);
    NRF_MESH_ASSERT(p_encrypted_upper_trs_packet != NULL);
    NRF_MESH_ASSERT(p_metadata != NULL);

    ccm_soft_data_t ccm_data;
    ccm_data.p_key = p_metadata->p_security_material->key;

    uint8_t app_nonce_buf[CCM_NONCE_LENGTH];
    enc_nonce_generate(&p_metadata->net,
                       (p_metadata->type.access.using_app_key ? ENC_NONCE_APP : ENC_NONCE_DEV),
                       (p_metadata->mic_size == TRANSPORT_MIC_SIZE_LARGE),
                       app_nonce_buf);

    ccm_data.p_nonce = app_nonce_buf;
    ccm_data.p_m     = p_unencrypted_upper_trs_packet;
    ccm_data.m_len   = upper_trs_payload_len;
    ccm_data.p_out   = p_encrypted_upper_trs_packet;
    ccm_data.p_mic   = (uint8_t *) ccm_data.p_out + ccm_data.m_len;
    ccm_data.mic_len = p_metadata->mic_size;

