NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/core/src/transport.c
    if (p_metadata->net.dst.type == NRF_MESH_ADDRESS_TYPE_VIRTUAL)
    {
        NRF_MESH_ASSERT(p_metadata->net.dst.p_virtual_uuid != NULL);
        ccm_data.p_a   = p_metadata->net.dst.p_virtual_uuid;
        ccm_data.a_len = NRF_MESH_KEY_SIZE;
    }
    else
    {
        ccm_data.a_len = 0;
    }

    enc_aes_ccm_encrypt(&ccm_data);
}

static void transport_metadata_from_tx_params(transport_packet_metadata_t * p_metadata,
                                              const nrf_mesh_tx_params_t * p_tx_params)
{
    p_metadata->type.access.app_key_id = p_tx_params->security_material.p_app->aid;
    p_metadata->type.access.using_app_key = (!p_tx_params->security_material.p_app->is_device_key);
    p_metadata->p_security_material = p_tx_params->security_material.p_app;
    p_metadata->segmented = ((p_tx_params->data_len > PACKET_MESH_TRS_UNSEG_ACCESS_PDU_MAX_SIZE - TRANSPORT_MIC_SIZE_SMALL) ||
                             p_tx_params->reliable);

    if (p_metadata->segmented)
    {
        p_metadata->mic_size = m_trs_config.szmic ? TRANSPORT_MIC_SIZE_LARGE : TRANSPORT_MIC_SIZE_SMALL;

        uint32_t num_segments = ((p_tx_params->data_len + p_metadata->mic_size +
                                  PACKET_MESH_TRS_SEG_ACCESS_PDU_MAX_SIZE - 1) /
                                 PACKET_MESH_TRS_SEG_ACCESS_PDU_MAX_SIZE);
        p_metadata->segmentation.last_segment = num_segments - 1;
        p_metadata->segmentation.segment_offset = 0;
    }
    else
    {
        p_metadata->mic_size = TRANSPORT_MIC_SIZE_SMALL; /* Locked for unsegmented packets */
    }

    p_metadata->net.control_packet = false;
    p_metadata->net.dst = p_tx_params->dst;
    p_metadata->net.p_security_material = p_tx_params->security_material.p_net;
    p_metadata->net.src = p_tx_params->src;
    p_metadata->net.ttl = p_tx_params->ttl;
    p_metadata->token = p_tx_params->tx_token;
}

static void transport_metadata_from_control_tx_params(
    transport_packet_metadata_t * p_metadata,
    const transport_control_packet_t * p_tx_params,
    nrf_mesh_tx_token_t tx_token)
{
    p_metadata->type.control.opcode = p_tx_params->opcode;
    p_metadata->p_security_material = NULL;
    p_metadata->segmented = ((p_tx_params->data_len > PACKET_MESH_TRS_UNSEG_CONTROL_PDU_MAX_SIZE) ||
                             p_tx_params->reliable);
    p_metadata->mic_size = TRANSPORT_MIC_SIZE_CONTROL;

    if (p_metadata->segmented)
    {
        uint32_t num_segments =
            ((p_tx_params->data_len + PACKET_MESH_TRS_SEG_CONTROL_PDU_MAX_SIZE - 1) /
             PACKET_MESH_TRS_SEG_CONTROL_PDU_MAX_SIZE);
        p_metadata->segmentation.last_segment = num_segments - 1;
        p_metadata->segmentation.segment_offset = 0;
    }

    p_metadata->net.control_packet      = true;
    p_metadata->net.dst                 = p_tx_params->dst;
    p_metadata->net.src                 = p_tx_params->src;
    p_metadata->net.p_security_material = p_tx_params->p_net_secmat;
    p_metadata->net.ttl                 = p_tx_params->ttl;

    p_metadata->token = tx_token;
}

static uint32_t unsegmented_packet_tx(transport_packet_metadata_t * p_metadata,
                                      const uint8_t * p_payload,
                                      uint32_t payload_len)
{
    if (payload_len + p_metadata->mic_size > TRANSPORT_UNSEG_PDU_LEN(p_metadata->net.control_packet))
    {
        return NRF_ERROR_INVALID_LENGTH;
    }
    network_tx_packet_buffer_t net_buf;

    uint8_t * p_packet_buffer_payload;
    uint32_t status = upper_trs_packet_alloc(p_metadata,
                                             &net_buf,
                                             payload_len + p_metadata->mic_size,
                                             &p_packet_buffer_payload);
    if (status == NRF_SUCCESS)
    {
        trs_packet_header_build(p_metadata, (packet_mesh_trs_packet_t *) net_buf.p_payload);

        if (p_metadata->net.control_packet)
        {
            memcpy(p_packet_buffer_payload, p_payload, payload_len);
        }
        else
        {
            upper_trs_packet_encrypt(p_payload, p_packet_buffer_payload, payload_len, p_metadata);
        }

        network_packet_send(&net_buf);
    }
    return status;
}

static bool sar_segment_send(trs_sar_ctx_t * p_sar_ctx, uint32_t segment_index)
{
    uint32_t segment_len = TRANSPORT_SAR_PDU_LEN(p_sar_ctx->metadata.net.control_packet);
    uint32_t payload_offset = segment_len * segment_index;

    /* The last segment won't necessarily fill the whole length: */
    if (segment_index == p_sar_ctx->metadata.segmentation.last_segment)
    {
        segment_len = p_sar_ctx->session.length - payload_offset;
    }

    p_sar_ctx->metadata.segmentation.segment_offset = segment_index;
    network_tx_packet_buffer_t net_buf;
    uint8_t * p_segment_payload;
    uint32_t status = upper_trs_packet_alloc(&p_sar_ctx->metadata,
                                             &net_buf,
                                             segment_len,
                                             &p_segment_payload);
    if (status == NRF_SUCCESS)
    {
        if (segment_index == 0 && !p_sar_ctx->session.params.tx.seqzero_is_set)
        {
            p_sar_ctx->metadata.segmentation.seq_zero =
                (p_sar_ctx->metadata.net.internal.sequence_number & TRANSPORT_SAR_SEQZERO_MASK);
            p_sar_ctx->session.params.tx.seqzero_is_set = true;
        }
        /* The payload couldn't be encrypted before we allocated the first packet, as we needed to
         * allocate a seqnum and iv index for the nonce. */
        if (!p_sar_ctx->metadata.net.control_packet && !p_sar_ctx->session.params.tx.payload_encrypted)
        {
            NRF_MESH_ASSERT(segment_index == 0);

            upper_trs_packet_encrypt(p_sar_ctx->payload,
                                     p_sar_ctx->payload,
                                     p_sar_ctx->session.length - p_sar_ctx->metadata.mic_size,
                                     &p_sar_ctx->metadata);
            p_sar_ctx->session.params.tx.payload_encrypted = true;
        }

        trs_packet_header_build(&p_sar_ctx->metadata, (packet_mesh_trs_packet_t *) net_buf.p_payload);
        memcpy(p_segment_payload, &p_sar_ctx->payload[payload_offset], segment_len);
        network_packet_send(&net_buf);
    }

    return (status == NRF_SUCCESS);
}

/**
 * Send SAR segments.
 *
 * @param[in,out] p_sar_ctx SAR context to send segments of.
 *
 * @returns Number of segments sent.
 */
static uint32_t trs_sar_packet_out(trs_sar_ctx_t * p_sar_ctx)
{
    uint32_t sent_segments = 0;
    /* Starts at start_index if, e.g., there was no memory available last round. */
    for (uint8_t i = p_sar_ctx->session.params.tx.start_index;
         i <= p_sar_ctx->metadata.segmentation.last_segment;
         ++i)
    {
        if ((p_sar_ctx->session.block_ack & (1u << i)) == 0)
        {
            /* packet hasn't been acked yet */
            if (sar_segment_send(p_sar_ctx, i))
            {
                sent_segments++;
                /* Set the start index to the next packet, so we know where to pick up in case of failure: */
                p_sar_ctx->session.params.tx.start_index = i + 1;
            }
            else
            {
                break;
            }
        }
    }
    return sent_segments;
}

static uint32_t segmented_packet_tx(const transport_packet_metadata_t * p_metadata,
                                    const uint8_t * p_payload,
                                    uint32_t payload_len)
{
    uint32_t packet_length = payload_len + p_metadata->mic_size;
    if (packet_length > TRANSPORT_SAR_PACKET_MAX_SIZE(p_metadata->net.control_packet))
    {
        return NRF_ERROR_INVALID_LENGTH;
    }
    trs_sar_ctx_t * p_sar_ctx = NULL;
    uint32_t was_masked;
    _DISABLE_IRQS(was_masked); //TODO: Can this be changed to bearer_event_critical_section, or removed all-together?
    for (int i = 0; i < TRANSPORT_SAR_SESSIONS_MAX; ++i)
    {
        if (m_trs_sar_sessions[i].session.session_type == TRS_SAR_SESSION_INACTIVE)
        {
            p_sar_ctx = &m_trs_sar_sessions[i];
            break;
        }
    }
    _ENABLE_IRQS(was_masked);

    if (p_sar_ctx == NULL)
    {
        return NRF_ERROR_NO_MEM;
    }
    if (sar_ctx_alloc(p_sar_ctx, p_metadata, TRS_SAR_SESSION_TX, packet_length))
    {
        memcpy(p_sar_ctx->payload, p_payload, payload_len);

