NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/core/src/transport.c
        __LOG(LOG_SRC_TRANSPORT, LOG_LEVEL_INFO, "Successfully created SAR packet\n");
        __LOG_XB(LOG_SRC_TRANSPORT,
                LOG_LEVEL_INFO,
                "SAR packet",
                p_sar_ctx->payload,
                p_sar_ctx->session.length);

        (void) trs_sar_packet_out(p_sar_ctx);/* Ignore return, as we'll reset the retry timer regardless. */
        tx_retry_timer_reset(p_sar_ctx);

        return NRF_SUCCESS;
    }
    else
    {
        return NRF_ERROR_NO_MEM;
    }
}


/** Process ongoing SAR TX sessions. */
static void trs_sar_tx_process(void)
{
    /* Loop through all active sessions and (re-)transmit remaining packets. */
    for (uint32_t i = 0; i < TRANSPORT_SAR_SESSIONS_MAX; ++i)
    {
        if (m_trs_sar_sessions[i].session.session_type == TRS_SAR_SESSION_TX)
        {
            if (trs_sar_packet_out(&m_trs_sar_sessions[i]) != 0)
            {
                tx_retry_timer_reset(&m_trs_sar_sessions[i]);
            }
        }
    }
}

static void trs_sar_rx_process(void)
{
    for (uint32_t i = 0; i < TRANSPORT_SAR_SESSIONS_MAX; ++i)
    {
        if (m_trs_sar_sessions[i].session.session_type == TRS_SAR_SESSION_RX &&
            m_trs_sar_sessions[i].session.params.rx.ack_state == SAR_ACK_STATE_PENDING)
        {
            if (sar_ack_send(&m_trs_sar_sessions[i].metadata, m_trs_sar_sessions[i].session.block_ack) == NRF_SUCCESS)
            {
                m_trs_sar_sessions[i].session.params.rx.ack_state = SAR_ACK_STATE_IDLE;
                if (m_trs_sar_sessions[i].session.block_ack == block_ack_full(&m_trs_sar_sessions[i].metadata))
                {
                    sar_ctx_rx_complete(&m_trs_sar_sessions[i]);
                }
            }
        }
    }
}

static bool transport_sar_process(void)
{
    trs_sar_tx_process();
    trs_sar_rx_process();
    return true;
}

static uint32_t upper_trs_packet_decrypt(transport_packet_metadata_t * p_metadata,
                                         const uint8_t * p_upper_trs_packet,
                                         uint32_t upper_trs_packet_len,
                                         uint8_t * p_upper_trs_packet_out)
{
    /* Use seq_zero network sequence number if this is a segmented message */
    uint32_t old_network_seqnum = p_metadata->net.internal.sequence_number;
    if (p_metadata->segmented)
    {
        p_metadata->net.internal.sequence_number =
            seqauth_sequence_number_get(p_metadata->net.internal.sequence_number,
                                        p_metadata->segmentation.seq_zero);
    }
    /* Calculate nonce */
    uint8_t app_nonce_buf[CCM_NONCE_LENGTH];
    enc_nonce_generate(&p_metadata->net,
                       ((p_metadata->type.access.using_app_key) ? ENC_NONCE_APP : ENC_NONCE_DEV),
                       (p_metadata->mic_size == TRANSPORT_MIC_SIZE_LARGE),
                       app_nonce_buf);
    /* Reset the network sequence number to its original value, to keep a predictable state. */
    p_metadata->net.internal.sequence_number = old_network_seqnum;

    ccm_soft_data_t ccm_data;
    ccm_data.p_nonce = app_nonce_buf;
    ccm_data.p_m     = p_upper_trs_packet;
    ccm_data.m_len   = (upper_trs_packet_len - p_metadata->mic_size);
    ccm_data.p_mic   = (uint8_t *) ccm_data.p_m + ccm_data.m_len;
    ccm_data.p_out   = p_upper_trs_packet_out;
    ccm_data.mic_len = p_metadata->mic_size;
    ccm_data.a_len = 0;

    if (p_metadata->net.dst.type == NRF_MESH_ADDRESS_TYPE_VIRTUAL)
    {
        ccm_data.a_len = NRF_MESH_UUID_SIZE;
    }

    if (p_metadata->type.access.using_app_key)
    {
        do {
            if (p_metadata->net.dst.type == NRF_MESH_ADDRESS_TYPE_VIRTUAL)
            {
                ccm_data.p_a = p_metadata->net.dst.p_virtual_uuid;
            }

            /* Application key */
            p_metadata->p_security_material = NULL;
            for (nrf_mesh_app_secmat_next_get(p_metadata->net.p_security_material,
                                              p_metadata->type.access.app_key_id,
                                              &p_metadata->p_security_material);
                 p_metadata->p_security_material != NULL;
                 nrf_mesh_app_secmat_next_get(p_metadata->net.p_security_material,
                                              p_metadata->type.access.app_key_id,
                                              &p_metadata->p_security_material))
            {
                if (test_transport_decrypt(p_metadata->p_security_material, &ccm_data))
                {
                    return NRF_SUCCESS;
                }
            }
        } while (p_metadata->net.dst.type == NRF_MESH_ADDRESS_TYPE_VIRTUAL &&
                 nrf_mesh_rx_address_get(p_metadata->net.dst.value, &p_metadata->net.dst));
    }
    else
    {
        /* Device key */
        p_metadata->p_security_material = NULL;
        if (p_metadata->net.dst.type == NRF_MESH_ADDRESS_TYPE_UNICAST)
        {
            nrf_mesh_devkey_secmat_get(p_metadata->net.dst.value, &p_metadata->p_security_material);
            if (test_transport_decrypt(p_metadata->p_security_material, &ccm_data))
            {
                return NRF_SUCCESS;
            }
        }

        /* try the src address */
        p_metadata->p_security_material = NULL;
        nrf_mesh_devkey_secmat_get(p_metadata->net.src, &p_metadata->p_security_material);
        if (test_transport_decrypt(p_metadata->p_security_material, &ccm_data))
        {
            return NRF_SUCCESS;
        }
    }

    return NRF_ERROR_NOT_FOUND;
}

static void transport_metadata_build(const packet_mesh_trs_packet_t * p_transport_packet,
                                     const network_packet_metadata_t * p_net_metadata,
                                     transport_packet_metadata_t * p_trs_metadata)
{
    memcpy(&p_trs_metadata->net, p_net_metadata, sizeof(network_packet_metadata_t));
    p_trs_metadata->segmented = packet_mesh_trs_common_seg_get(p_transport_packet);

    if (p_trs_metadata->net.control_packet)
    {
        p_trs_metadata->type.control.opcode = (transport_control_opcode_t) packet_mesh_trs_control_opcode_get(p_transport_packet);
        p_trs_metadata->mic_size = TRANSPORT_MIC_SIZE_CONTROL;
    }
    else
    {
        p_trs_metadata->type.access.using_app_key = packet_mesh_trs_access_akf_get(p_transport_packet);
        p_trs_metadata->type.access.app_key_id = packet_mesh_trs_access_aid_get(p_transport_packet);
        if (p_trs_metadata->segmented)
        {
            p_trs_metadata->mic_size = ((packet_mesh_trs_seg_szmic_get(p_transport_packet)) ? TRANSPORT_MIC_SIZE_LARGE : TRANSPORT_MIC_SIZE_SMALL);
        }
        else
        {
            p_trs_metadata->mic_size = TRANSPORT_MIC_SIZE_SMALL;
        }
    }

    if (p_trs_metadata->segmented)
    {
        p_trs_metadata->segmentation.seq_zero       = packet_mesh_trs_seg_seqzero_get(p_transport_packet);
        p_trs_metadata->segmentation.segment_offset = packet_mesh_trs_seg_sego_get(p_transport_packet);
        p_trs_metadata->segmentation.last_segment   = packet_mesh_trs_seg_segn_get(p_transport_packet);
    }
    /* Not enough information to populate the secmat yet. */
    p_trs_metadata->p_security_material = NULL;
}

