NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/core/src/transport.c
static void segack_packet_in(const packet_mesh_trs_control_packet_t * p_trs_control_packet,
                             uint32_t control_packet_len,
                             transport_packet_metadata_t * p_metadata,
                             const nrf_mesh_rx_metadata_t * p_rx_metadata)
{
    if (control_packet_len != PACKET_MESH_TRS_CONTROL_SEGACK_SIZE)
    {
        return;
    }
    uint16_t seq_zero = packet_mesh_trs_control_segack_seqzero_get(p_trs_control_packet);
    uint32_t block_ack = packet_mesh_trs_control_segack_block_ack_get(p_trs_control_packet);

    trs_sar_ctx_t * p_sar_ctx = sar_ctx_find(p_metadata->net.dst.value, seq_zero);
    if (p_sar_ctx == NULL || p_sar_ctx->session.session_type != TRS_SAR_SESSION_TX)
    {
        __LOG(LOG_SRC_TRANSPORT, LOG_LEVEL_WARN, "Could not find active session for ACK packet\n");
    }
    else
    {
        __INTERNAL_EVENT_PUSH(INTERNAL_EVENT_TRS_ACK_RECEIVED, 0, control_packet_len, p_trs_control_packet);

        p_sar_ctx->session.block_ack |= block_ack;
        if (block_ack == 0)
        {
            sar_ctx_cancel(p_sar_ctx, NRF_MESH_SAR_CANCEL_BY_PEER);
        }
        else if (p_sar_ctx->session.block_ack == block_ack_full(&p_sar_ctx->metadata))
        {
            /* All segments received */
            sar_ctx_tx_complete(p_sar_ctx);
        }
        else
        {
            /* Mesh Profile Specification v1.0, section 3.5.3.3: "If a Segment Acknowledgment message is received that
             * is a valid acknowledgment for the segmented message, then the lower transport layer
             * shall reset the segment transmission timer and retransmit all unacknowledged Lower
             * Transport PDUs." */
             p_sar_ctx->session.params.tx.start_index = 0;
             (void) trs_sar_packet_out(p_sar_ctx); /* Ignore return, as we'll reset the retry timer regardless. */
             tx_retry_timer_reset(p_sar_ctx);
        }
    }
}

static transport_control_packet_callback_t control_packet_callback_get(transport_control_opcode_t opcode)
{
    for (uint32_t consumer = 0; consumer < m_control_packet_consumer_count; ++consumer)
    {
        const control_packet_consumer_t * p_consumer = &m_control_packet_consumers[consumer];
        for (uint32_t handler = 0; handler < p_consumer->handler_count; ++handler)
        {
            const transport_control_packet_handler_t * p_handler = &p_consumer->p_handlers[handler];
            if (p_handler->opcode == opcode)
            {
                return p_handler->callback;
            }
        }
    }
    return NULL;
}

static void transport_control_packet_in(const packet_mesh_trs_control_packet_t * p_trs_control_packet,
                                        uint32_t control_packet_len,
                                        transport_packet_metadata_t * p_metadata,
                                        const nrf_mesh_rx_metadata_t * p_rx_metadata)
{
    switch (p_metadata->type.control.opcode)
    {
        /* The Segack handler is internal to the lower transport layer, and is handled inline. */
        case TRANSPORT_CONTROL_OPCODE_SEGACK:
            segack_packet_in(p_trs_control_packet, control_packet_len, p_metadata, p_rx_metadata);
            break;

        default:
        {
            transport_control_packet_callback_t callback = control_packet_callback_get(p_metadata->type.control.opcode);
            if (callback != NULL)
            {
                transport_control_packet_t control_packet;
                control_packet.opcode       = p_metadata->type.control.opcode;
                control_packet.p_net_secmat = p_metadata->net.p_security_material;
                control_packet.src          = p_metadata->net.src;
                control_packet.dst          = p_metadata->net.dst;
                control_packet.ttl          = p_metadata->net.ttl;
                control_packet.p_data       = p_trs_control_packet;
                control_packet.data_len     = control_packet_len;
                control_packet.reliable     = p_metadata->segmented;
                callback(&control_packet, p_rx_metadata);
            }
            break;
        }
    }
}

static void upper_transport_access_packet_in(const uint8_t * p_upper_trs_packet,
                                             uint32_t upper_trs_packet_len,
                                             transport_packet_metadata_t * p_metadata,
                                             const nrf_mesh_rx_metadata_t * p_rx_metadata)
{
    uint8_t decrypt_buffer[TRANSPORT_SAR_PACKET_MAX_SIZE(false)]; /* 382 bytes! */

    uint32_t status = upper_trs_packet_decrypt(p_metadata, p_upper_trs_packet, upper_trs_packet_len, decrypt_buffer);
    if (status == NRF_SUCCESS)
    {
        __INTERNAL_EVENT_PUSH(INTERNAL_EVENT_DECRYPT_TRS,
                                0,
                                upper_trs_packet_len - p_metadata->mic_size,
                                p_upper_trs_packet);

        nrf_mesh_address_t src_address = {.type = NRF_MESH_ADDRESS_TYPE_UNICAST,
                                        .value = p_metadata->net.src,
                                        .p_virtual_uuid = NULL};
        nrf_mesh_evt_t rx_event;
        rx_event.type = NRF_MESH_EVT_MESSAGE_RECEIVED;
        rx_event.params.message.p_buffer = decrypt_buffer;
        rx_event.params.message.length = upper_trs_packet_len - p_metadata->mic_size;
        rx_event.params.message.src = src_address;
        rx_event.params.message.dst = p_metadata->net.dst;
        rx_event.params.message.ttl = p_metadata->net.ttl;
        rx_event.params.message.secmat.p_net = p_metadata->net.p_security_material;
        rx_event.params.message.secmat.p_app = p_metadata->p_security_material;
        rx_event.params.message.p_metadata = p_rx_metadata;
        event_handle(&rx_event);
    }
    else
    {
        __LOG(LOG_SRC_TRANSPORT, LOG_LEVEL_DBG2, "Could not decrypt transport layer data.\n");

        __INTERNAL_EVENT_PUSH(INTERNAL_EVENT_PACKET_DROPPED,
                                (p_metadata->type.access.using_app_key ? PACKET_DROPPED_INVALID_APPKEY
                                                                : PACKET_DROPPED_INVALID_DEVKEY),
                                upper_trs_packet_len,
                                p_upper_trs_packet);
    }
}

static void upper_transport_packet_in(const uint8_t * p_upper_trs_packet,
                                      uint32_t upper_trs_packet_len,
                                      transport_packet_metadata_t * p_metadata,
                                      const nrf_mesh_rx_metadata_t * p_rx_metadata)
{
    if (p_metadata->net.control_packet)
    {
        transport_control_packet_in((packet_mesh_trs_control_packet_t *) p_upper_trs_packet,
                                    upper_trs_packet_len,
                                    p_metadata,
                                    p_rx_metadata);
    }
    else
    {
        upper_transport_access_packet_in(p_upper_trs_packet, upper_trs_packet_len, p_metadata, p_rx_metadata);
    }
}

static void ack_timeout(timestamp_t timestamp, void * p_context)
{
    trs_sar_ctx_t * p_sar_ctx = p_context;
    NRF_MESH_ASSERT(p_sar_ctx->session.session_type == TRS_SAR_SESSION_RX);
    p_sar_ctx->session.params.rx.ack_state = SAR_ACK_STATE_PENDING;
    if (sar_ack_send(&p_sar_ctx->metadata, p_sar_ctx->session.block_ack) == NRF_SUCCESS)
    {
        p_sar_ctx->session.params.rx.ack_state = SAR_ACK_STATE_IDLE;
    }
}

static void retry_timeout(timestamp_t timestamp, void * p_context)
{
    trs_sar_ctx_t * p_sar_ctx = p_context;
    NRF_MESH_ASSERT(p_sar_ctx->session.session_type == TRS_SAR_SESSION_TX);
    if (p_sar_ctx->session.params.tx.retries == 0)
    {
        /* We're out of retries. Should give up. */
        if (p_sar_ctx->metadata.net.dst.type == NRF_MESH_ADDRESS_TYPE_UNICAST)
        {
            sar_ctx_cancel(p_sar_ctx, NRF_MESH_SAR_CANCEL_REASON_TIMEOUT);
        }
        else
        {
            /* For non-unicast addresses, timing out is considered a successful way to end, as there
             * are no acknowledgements. */
            sar_ctx_tx_complete(p_sar_ctx);
        }
    }
    else
    {
        p_sar_ctx->session.params.tx.retries--;
        p_sar_ctx->session.params.tx.start_index = 0;
        (void) trs_sar_packet_out(p_sar_ctx);/* Ignore return, as the timer will be rescheduled regardless. */
    }
}

static void abort_timeout(timestamp_t timestamp, void * p_context)
{
    trs_sar_ctx_t * p_sar_ctx = p_context;
    sar_ctx_cancel(p_sar_ctx, NRF_MESH_SAR_CANCEL_REASON_TIMEOUT);
}

/** TX Complete callback, executes in interrupt context! */
static void tx_complete(const core_tx_metadata_t * p_metadata, uint32_t timestamp, nrf_mesh_tx_token_t token)
{
    if (p_metadata->role == CORE_TX_ROLE_ORIGINATOR && token != SAR_TOKEN)
    {
        /* This tx complete came from the application. */
        nrf_mesh_evt_t evt;
        evt.type = NRF_MESH_EVT_TX_COMPLETE;
        evt.params.tx_complete.token = token;
        event_handle(&evt);
    }
    bearer_event_flag_set(m_sar_process_flag);
}

