NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/core/src/transport.c
static uint32_t upper_transport_tx(transport_packet_metadata_t * p_metadata, const uint8_t * p_data, uint32_t data_len)
{
    if (nrf_mesh_address_type_get(p_metadata->net.src) != NRF_MESH_ADDRESS_TYPE_UNICAST ||
        p_metadata->net.dst.type == NRF_MESH_ADDRESS_TYPE_INVALID ||
        (p_metadata->net.dst.type == NRF_MESH_ADDRESS_TYPE_VIRTUAL && p_metadata->net.dst.p_virtual_uuid == NULL))
    {
        return NRF_ERROR_INVALID_ADDR;
    }
    if (p_metadata->net.ttl > NRF_MESH_TTL_MAX)
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    if (p_metadata->segmented)
    {
        return segmented_packet_tx(p_metadata, p_data, data_len);
    }
    else
    {
        return unsegmented_packet_tx(p_metadata, p_data, data_len);
    }
}
/**************
 * Public API *
 **************/
void transport_init(const nrf_mesh_init_params_t * p_init_params)
{
    transport_sar_mem_funcs_reset();

    memset(&m_trs_sar_sessions[0], 0, sizeof(m_trs_sar_sessions));

    replay_cache_init();

    m_sar_session_cache_head = 0;

    m_trs_config.rx_timeout                = TRANSPORT_SAR_RX_TIMEOUT_DEFAULT_US;
    m_trs_config.rx_ack_base_timeout       = TRANSPORT_SAR_RX_ACK_BASE_TIMEOUT_DEFAULT_US;
    m_trs_config.rx_ack_per_hop_addition   = TRANSPORT_SAR_RX_ACK_PER_HOP_ADDITION_DEFAULT_US;
    m_trs_config.tx_retry_base_timeout     = TRANSPORT_SAR_TX_RETRY_BASE_TIMEOUT_DEFAULT_US;
    m_trs_config.tx_retry_per_hop_addition = TRANSPORT_SAR_TX_RETRY_PER_HOP_ADDITION_DEFAULT_US;
    m_trs_config.tx_retries                = TRANSPORT_SAR_TX_RETRIES_DEFAULT;
    m_trs_config.szmic                     = 0;
    m_trs_config.segack_ttl                = TRANSPORT_SAR_SEGACK_TTL_DEFAULT;
    m_sar_process_flag = bearer_event_flag_add(transport_sar_process);
    m_control_packet_consumer_count = 0;

    core_tx_complete_cb_set(tx_complete);

}

uint32_t transport_sar_mem_funcs_set(transport_sar_alloc_t alloc_func, transport_sar_release_t release_func)
{
    if ((alloc_func == NULL) != (release_func == NULL)) /*lint !e731 Boolean arguments to equal/not equal operator */
    {
        /* Both functions must be NULL or non-NULL, but not a mix of both. */
        return NRF_ERROR_NULL;
    }
    else if (alloc_func == NULL && release_func == NULL)
    {
        transport_sar_mem_funcs_reset();
        return NRF_SUCCESS;
    }
    uint32_t was_masked;
    _DISABLE_IRQS(was_masked);
    m_sar_alloc = alloc_func;
    m_sar_release = release_func;
    _ENABLE_IRQS(was_masked);
    return NRF_SUCCESS;
}

void transport_sar_mem_funcs_reset(void)
{
    NRF_MESH_ERROR_CHECK(transport_sar_mem_funcs_set(malloc, free));
}

uint32_t transport_packet_in(const packet_mesh_trs_packet_t * p_packet,
                             uint32_t trs_packet_len,
                             const network_packet_metadata_t * p_net_metadata,
                             const nrf_mesh_rx_metadata_t * p_rx_metadata)
{
    uint32_t status = NRF_SUCCESS;

    if (p_packet == NULL || p_net_metadata == NULL)
    {
        return NRF_ERROR_NULL;
    }

    /* nrf_mesh_rx_address_get requires a clean address structure on the first call. */
    nrf_mesh_address_t dst_addr;
    memset(&dst_addr, 0, sizeof(nrf_mesh_address_t));

    if (!nrf_mesh_rx_address_get(p_net_metadata->dst.value, &dst_addr))
    {
        __INTERNAL_EVENT_PUSH(INTERNAL_EVENT_PACKET_DROPPED,
                              PACKET_DROPPED_UNKNOWN_ADDRESS,
                              trs_packet_len,
                              p_packet);
        return status;
    }

    if (replay_cache_has_elem(p_net_metadata->src,
                              p_net_metadata->internal.sequence_number,
                              p_net_metadata->internal.iv_index & NETWORK_IVI_MASK))
    {
        __INTERNAL_EVENT_PUSH(INTERNAL_EVENT_PACKET_DROPPED,
                              PACKET_DROPPED_REPLAY_CACHE,
                              trs_packet_len,
                              p_packet);
        return status;
    }

    status = replay_cache_add(p_net_metadata->src,
                              p_net_metadata->internal.sequence_number,
                              p_net_metadata->internal.iv_index & NETWORK_IVI_MASK);
    if (status != NRF_SUCCESS)
    {
        m_send_replay_cache_full_event(p_net_metadata->src,
                                       p_net_metadata->internal.iv_index & NETWORK_IVI_MASK,
                                       NRF_MESH_RX_FAILED_REASON_REPLAY_CACHE_FULL);
        return status;
    }

    transport_packet_metadata_t trs_metadata;
    transport_metadata_build(p_packet, p_net_metadata, &trs_metadata);
    /* Insert the lookup-address in case it's different from the one in p_net_metadata. */
    trs_metadata.net.dst = dst_addr;

    /* The packet handler functions operate on static global state, that potentially can be accessed
     * from timers. */
    bearer_event_critical_section_begin();

    if (trs_metadata.segmented)
    {
        trs_sar_seg_packet_in(packet_mesh_trs_seg_payload_get(p_packet),
                              trs_packet_len - PACKET_MESH_TRS_SEG_PDU_OFFSET,
                              &trs_metadata,
                              p_rx_metadata);
    }
    else
    {
        upper_transport_packet_in(packet_mesh_trs_unseg_payload_get(p_packet),
                                  trs_packet_len - PACKET_MESH_TRS_UNSEG_PDU_OFFSET,
                                  &trs_metadata,
                                  p_rx_metadata);
    }

    bearer_event_critical_section_end();

    return NRF_SUCCESS;
}

uint32_t transport_tx(const nrf_mesh_tx_params_t * p_params, uint32_t * const p_packet_reference)
{
    if (p_params == NULL ||
        p_params->p_data == NULL ||
        p_params->security_material.p_app == NULL ||
        p_params->security_material.p_net == NULL)
    {
        return NRF_ERROR_NULL;
    }

    transport_packet_metadata_t metadata;
    transport_metadata_from_tx_params(&metadata, p_params);

    return upper_transport_tx(&metadata, p_params->p_data, p_params->data_len);
}

uint32_t transport_control_tx(const transport_control_packet_t * p_params, nrf_mesh_tx_token_t tx_token)
{
    if (p_params == NULL ||
        p_params->p_data == NULL ||
        p_params->p_net_secmat == NULL)
    {
        return NRF_ERROR_NULL;
    }
    if (p_params->dst.type == NRF_MESH_ADDRESS_TYPE_VIRTUAL ||
        p_params->dst.type == NRF_MESH_ADDRESS_TYPE_INVALID)
    {
        return NRF_ERROR_INVALID_ADDR;
    }
    if ((uint8_t) p_params->opcode > TRANSPORT_CONTROL_PACKET_OPCODE_MAX)
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    transport_packet_metadata_t metadata;
    transport_metadata_from_control_tx_params(&metadata, p_params, tx_token);

    return upper_transport_tx(&metadata, p_params->p_data->pdu, p_params->data_len);
}

uint32_t transport_opt_set(nrf_mesh_opt_id_t id, const nrf_mesh_opt_t * const p_opt)
{
    if (!p_opt)
    {
        return NRF_ERROR_NULL;
    }

